// // API_CALLER가 전달해준 JSON 중 조건에 맞는 자료만 정리

const EVENT_TARGETS = require("./EVENT_TARGETS.js");  



const BIZ_CODE = [
1169,1426,1468,1469,1470,1517,
3144,3156,3244,
//561,
5605,5608,5609,6529,6530,9901,9999
];

const KEYWORDS = {
  "기존": [
    "청년","인턴","일자리","직무","취업","캠프","일경험","혁신","여성","미래",
    "노인","장년","신중년","뉴딜","평생","지역","참여자","기업","체험","온라인",
    "DX","맞춤형","인생","훈련","양성","전문","진로","상생","고용","노동","인재"
  ],
  "added_revised": [
  "관광","아카데미","강소기업","도전지원","성장프로젝트","청년카페","공직가치","역량교육",
   "시민아카데미","환경산업","데이터인재","사이버교육","인성아카데미","창의행정",
  "워크숍","재생에너지","채용관리","취업사관학교","뷰티비즈니스","K-디지털","마이스","거버넌스",
  "액셀러레이팅","경력보유여성","ICT","리더십","G-콘텐츠","체육인재","핀테크",
  "민박업","디지털크리에이터","소수언어권","조직역량","산림생태관광","외국인유학생","갭이어",
  "보건인력","재외동포","세종학당","문화인턴","판로지원","체육인","투자유치",
  "신기술","과학관","농업기술","농촌","기후위기","경제성분석","네트워킹","딥테크",
  "베이비부머","컨설턴트","현장탐방","프로젝트기반","국외프로그램","직업연수","멘토링",
  "사회공헌","교육훈련","컨설팅","공무원","조직문화","상생컨설팅","재취업지원",
  "공감마당","특강","탐방","견학","공모사업","연수","교육과정","교육운영","위탁교육",
  "위탁운영","일자리정책","일자리전환","취업컨설팅","리모트인턴십","도시재생","주민역량강화","AX",
  "AI Transformation","AI반도체","기술인재","채용연계","잠재성장캠퍼스","콘텐츠코리아랩","스타트업육성","국외파견",
  "한국어교원","콘텐츠창의학교","사다리프로그램","온라인수출","인프라지원","시민교육","빅데이터",
  "4.5일제","맞춤컨설팅","효과성분석","농어촌취약지역","생활여건개조","휴먼케어","뉴빌리지",
  "직무분석","박람회","카카오테크캠퍼스","미디어콘텐츠","대형산불대응","솔루션기술개발",
  "집수리아카데미","재창업","특화교육","온택트교육","공공기관연계","국방핵심기술","성과컨퍼런스",
  "신규자교육","미혼남녀","만남행사","성인지교육","콘서트","아트페스티벌","축제","상권활성화",
  "수제맥주페스티벌","루나빛축제","사과소비촉진","발명교사","디자인법","의료AI","고용노동청",
  "채용박람회","예비팀장","로컬푸드","외식인재","관악형아카데미","YES공무원아카데미","스케일업",
  "포스트팁스","글로벌밋업","AI Agent","AI혁신클러스터","인플루언서","테크노파크","청정수소",
  "컨벤션","K-스포츠아카데미","정원박람회","전통시장","마음건강","첨단인재","해커톤",
  "빅테크","창업허브","K-컬처","Digilog","진료지원간호사","석탄발전",
  "재취업교육","중장년내일센터","리빙랩","R&D협력","겨울방학","늘봄학교","독서","창의과학",
  "성인지","청년취업사관학교","고용서비스","성과평가","외국인학생","창업캠프","QCC",
  "QuadCheckCamp","전문농업인","농업인양성","문화예술후원","먹거리콘텐츠","역사문화탐방",
  "정원문화","킨볼","스포츠","국제컨퍼런스","글로벌콘서트","방송커리어","Restart","AICT",
   "교육격차","아동청소년","소프트웨어교육","미래차","충전인프라","전통문화산업","전통가온",
   "성과공유회","WFK","NIPA","자문단","종합관리센터","Biz크리에이터","농촌협약","마을만들기",
   "역량평가","마인드향상","힐링교육","공감워크숍","한마음연수"
],
  "final_keywords": [
    "캠프","청년","인턴","일자리","직무","취업","캠프","일경험","혁신","여성","미래",
    "노인","장년","신중년","뉴딜","평생","지역","참여자","기업","체험","온라인",
    "DX","맞춤형","인생","훈련","양성","전문","진로","상생","고용","노동","인재",
    "관광","취업","청년","중장년","노인","여성","인턴","캠프","교육","훈련",
    "역량강화","창업","스타트업","멘토링","아카데미","컨설팅","고용","정책",
    "프로그램","지원","참여","기업","지역","혁신","디지털","AI","SW","데이터",
    "전문인력","산업","프로젝트","박람회","연수","공모","사회공헌","운영"
  ]

};